DunningLetters/DunningLetters/Files/NS_FU/Fusion/CreditDistribution/Create/Request/Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/financials/receivables/transactions/invoices/invoiceService/types/" xmlns:inv="http://xmlns.oracle.com/apps/financials/receivables/transactions/invoices/invoiceService/" xmlns:tran="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionDistributionInterfaceLineDff/" xmlns:tran1="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionDistributionDff/" xmlns:typ1="http://xmlns.oracle.com/adf/svc/types/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">   <soapenv:Header/>
   <soapenv:Body>
      <typ:processInterfaceDistribution>
         <typ:changeOperation>Create</typ:changeOperation>
          <typ:interfaceDistribution>
            <inv:AccountClass>REC</inv:AccountClass>
            <inv:OrgId>300000001870006</inv:OrgId>
            <inv:Percent>100</inv:Percent>
            <inv:CodeCombinationId>300000002427168</inv:CodeCombinationId>
            <inv:DistributionInterfacLineDff xsi:type="tran:Otherinvoicedetails" >
              <tran:__FLEX_Context>OtherInvoiceDetails</tran:__FLEX_Context>
              <tran:__FLEX_Context_DisplayValue>OtherInvoiceDetails</tran:__FLEX_Context_DisplayValue>
              <tran:otherinvoicedetails>11112020001CM_1</tran:otherinvoicedetails>
            </inv:DistributionInterfacLineDff>
          </typ:interfaceDistribution>
          <typ:interfaceDistribution>
            <inv:AccountClass>REV</inv:AccountClass> 
            <inv:OrgId>300000001870006</inv:OrgId>
            <inv:Amount >-132.51</inv:Amount>
            <inv:CodeCombinationId>300000002277505</inv:CodeCombinationId>
            <inv:DistributionInterfacLineDff xsi:type="tran:Otherinvoicedetails" >
              <tran:__FLEX_Context>OtherInvoiceDetails</tran:__FLEX_Context>
              <tran:__FLEX_Context_DisplayValue>OtherInvoiceDetails</tran:__FLEX_Context_DisplayValue>
              <tran:otherinvoicedetails>11112020001CM_1</tran:otherinvoicedetails>
            </inv:DistributionInterfacLineDff> 
          </typ:interfaceDistribution>
      </typ:processInterfaceDistribution>
   </soapenv:Body>
</soapenv:Envelope>